## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`



```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.get_metrics_token_secret_value_ecs_task will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "get_metrics_token_secret_value_ecs_task"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL",
            ]
        }
    }

  # aws_iam_policy.get_metrics_token_secret_value_ecs_task will be created
  + resource "aws_iam_policy" "get_metrics_token_secret_value_ecs_task" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "GetMetricstokenSecretValuePolicies"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.secretsmanager_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "secretsmanager_etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "metrics_task_execution_role"
    }

  # aws_kms_key.server_metrics_key will be created
  + resource "aws_kms_key" "server_metrics_key" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = (known after apply)
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = (known after apply)
      + tags_all                 = (known after apply)
    }

  # aws_secretsmanager_secret.metrics_token will be updated in-place
  ~ resource "aws_secretsmanager_secret" "metrics_token" {
        id                      = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL"
      + kms_key_id              = (known after apply)
        name                    = "server-metrics-token"
      + recovery_window_in_days = 30
        tags                    = {}
        # (3 unchanged attributes hidden)
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210702182404676800000002"
      - input          = jsonencode({}) -> null
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>